app/Http/Controllers/Api/AccessTokenController.php

select * from `users` where `email` = 'super_admin@clinic.com' and `users`.`deleted_at` is null limit 1
---
    public function store(Request $request){
        $request->validate([
            'email' =>'required|email|max:255',
            'password'=> 'required|string|min:6',
            'device_name'=>'string|max:255',
            'abilities'=>'nullable|array'
        ]);

        $user = User::where('email',$request->email)->first();