app/Http/Controllers/Api/AuthController.php

select * from `patients` where `email` = 'shabankareem919@gmail.com' and `patients`.`deleted_at` is null limit 1
---
    public function patientLogin(LoginPatientRequest $request)
    {
        // $request->validate([
        //     'email' => 'required|email|max:255',
        //     'password' => 'required|string|min:6',
        //     'device_name' => 'string|max:255',
        //     'abilities' => 'nullable|array'
        // ]);

        $patient = Patient::where('email', $request->email)->first();