app/Http/Controllers/Api/DoctorInformationController.php

select * from `settings` limit 9
---
    public function index()
{
    $doctorInfo = Settings::take(9)->get();