app/Http/Controllers/Api/PatientController.php

    public function store(StorePatientRequest $request){


            $request->validated();

            $patient = Patient::create($request->all());
---
select * from `patients` where `patients`.`deleted_at` is null

    public function update(UpdatePatientRequest $request,$id){

        $patient = Patient::find($id);
---
select * from `patients` where `patients`.`patient_id` = '1' and `patients`.`deleted_at` is null limit 1