app/Http/Controllers/Api/ReservationController.php

    public function index()
    {

        // بتحولها بشكل أتوماتيك laravel ال  json response ل model مش محتاج أحول ال

        $reservations = ReservationResource::collection(Reservation::get());
---
select * from `reservations` where `reservations`.`deleted_at` is null

    public function getResNumberOrSlotAdd(Request $request)
    {

        $res_date =  $request->res_date;

        // if system use reservation numbers not slots
        $reservation_res_num = Reservation::where('res_date', $res_date)->pluck('res_num')->map(function ($item) {
            return intval($item);
        })->toArray();
        $number_of_res = NumberOfReservations::where('reservation_date', $res_date)->value('num_of_reservations');


        // if system use reservation slots not numbers
        $reservation_slots = Reservation::where('res_date', $res_date)
        ->where('slot', '<>', 'null')->pluck('slot')->toArray();
        $number_of_slot = ReservationSlots::where('date', $res_date)->first();
        $slots = $number_of_slot ? $this->getTimeSlot($number_of_slot->duration, $number_of_slot->start_time, $number_of_slot->end_time) : [];

        $reservations  = Reservation::where('res_date',$res_date)->get();
---
select `res_num` from `reservations` where `res_date` = '2023-12-07' and `reservations`.`deleted_at` is null
select `num_of_reservations` from `number_of_reservations` where `reservation_date` = '2023-12-07' limit 1
select `slot` from `reservations` where `res_date` = '2023-12-07' and `slot` <> 'null' and `reservations`.`deleted_at` is null
select * from `reservation_slots` where `date` = '2023-12-07' limit 1
select * from `reservations` where `res_date` = '2023-12-07' and `reservations`.`deleted_at` is null