app/Http/Traits/SlotsNumbersCheck.php

select count(*) as aggregate from `number_of_reservations` where `reservation_date` = '2024-01-20'
---
    public function reservationNumberCheck($reservation_date)
    {
        $resNumberCount = NumberOfReservations::where('reservation_date', $reservation_date)->count();