<?php


return [
          'Home'=>'الرئيسية',
          'Services'=>'الخدمات',
          'About Us'=>'عنا',
          'Doctors'=>'الأطباء',
          'Blogs'=>'Blogs',
          'Register'=>'أنشاء حساب',
          'LogIn'=>'تسجل دخول', 
          'stay safe, stay healthy'=>'ابق آمنًا ، حافظ على صحتك',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',


];
