app/Http/Controllers/Backend/ReservationsControllers/NumberOfReservationsController.php

select * from `number_of_reservations`
---
    public function index()
    {

        $num_of_reservations = NumberOfReservations::all();