app/Http/Controllers/Backend/ReservationsControllers/OnlineReservationController.php

select * from `online_reservations`
---
    public function index()
    {
        $online_reservations = OnlineReservation::all();