app/Http/Controllers/Backend/ReservationsControllers/RaysController.php

select * from `reservations` where `reservations`.`reservation_id` = '2' and `reservations`.`deleted_at` is null limit 1
---
    public function add($id)
    {
        $this->authorizeCheck('أضافة أشعة و تحليل');
        $reservation = $this->reservation->findOrFail($id);

insert into `rays` (`reservation_id`, `patient_id`, `ray_name`, `ray_type`, `ray_date`, `images`, `updated_at`, `created_at`) values ('2', '1', 'أشعة x', 'أشعة x', '2024-01-19', 'palestine.png', '2024-01-19 21:37:34', '2024-01-19 21:37:34')
---
    public function store(StoreRayRequest $request)
    {
        $this->authorizeCheck('أضافة أشعة و تحليل');

        $request->validated();

        try {

            $data = $request->except('images');
            $image_path = $this->handleImageUpload($request, $this->ray);
            $data['images'] =  $image_path;
            $this->ray->create($data);