app/Http/Controllers/Backend/ReservationsControllers/ReservationController.php

select `value`, `key` from `system_controls`
---
    public function index()
    {
        $this->authorizeCheck('عرض الكشوفات');

        $reservations = $this->reservation->with('patient:patient_id,name')->get();
        $reservation_settings = $this->systemControl->pluck('value', 'key');