app/Http/Controllers/Backend/ReservationsControllers/ReservationSlotsController.php

    public function store(Request $request)
    {

        $request->validate([
            'date' => 'required|unique:reservation_slots,date',
            ]);


        $resNumber_check = $this->reservationNumberCheck($request->date);


        if($resNumber_check) {
            return redirect()->back()->with('toast_error', 'تم أضافة reservation number لهذا اليوم');
        } else {

            $data = $request->all();
            ReservationSlots::create($data);
---
insert into `reservation_slots` (`date`, `start_time`, `end_time`, `duration`, `total_reservations`, `updated_at`, `created_at`) values ('2024-01-20', '13:00', '18:00', '30', '', '2024-01-19 21:34:34', '2024-01-19 21:34:34')