app/Http/Controllers/Backend/ReservationsControllers/ReservationController.php

select * from `reservations` where `reservations`.`deleted_at` is null
select `patient_id`, `name` from `patients` where `patients`.`patient_id` in (1, 2, 3, 4, 10) and `patients`.`deleted_at` is null
select `value`, `key` from `reservation_controls`
select `value` from `settings` where `key` = 'clinic_type' limit 1
---
    public function index()
    {
        $reservations = $this->reservation->with('patient:patient_id,name')->get();
        $reservation_settings = $this->reservationControl->pluck('value', 'key');
        $clinic_type = $this->settings->where('key', 'clinic_type')->value('value');

select * from `reservations` where date(`res_date`) = '2023-07-20' and `reservations`.`deleted_at` is null
select `value`, `key` from `reservation_controls`
select `value` from `settings` where `key` = 'clinic_type' limit 1
---
    public function todayReservations()
    {
        $currentDate = Carbon::now()->format('Y-m-d');
        $reservations = $this->reservation->whereDate('res_date', Carbon::now())->get();
        $reservation_settings = $this->reservationControl->pluck('value', 'key');
        $clinic_type = $this->settings->where('key', 'clinic_type')->value('value');