app/Http/Controllers/Backend/ReservationsControllers/ReservationOptionsController.php

    public function ReservationAcceptance($id, $acceptance)
    {
        $reservation = $this->reservation->findOrFail($id);
        $reservation->acceptance = $acceptance;
        event(new AppointmentApproved($reservation));
        $reservation->save();
---
select * from `reservations` where `reservations`.`reservation_id` = '14' and `reservations`.`deleted_at` is null limit 1
update `reservations` set `acceptance` = 'approved', `reservations`.`updated_at` = '2023-07-20 14:19:38' where `reservation_id` = 14