<?php


return [
          'Home'=>'الرئيسية',
          'Services'=>'الخدمات',
          'About Us'=>'عنا',
          'Doctors'=>'الأطباء',
          'Blogs'=>'Blogs',
          'Register'=>'أنشاء حساب',
          'Log In'=>'تسجل دخول', 
          'stay safe, stay healthy'=>'ابق آمنًا ، حافظ على صحتك',
          'Numbers_Of_Doctors'=>'عدد الأطباء',
          'Numbers_Of_Patients'=>'عدد المرضى',
          'Numbers_Of_Reservations'=>'عدد الكشوفات',
          'About_Us'=>'عن العيادة',
          'Our_Blogs'=>'مدوناتنا',
          'we take care of your healthy life'=>'نحن نعتني بحياتك الصحية',
          'contact us'=>'تواصل معنا',
          'Our_Services'=>'خدماتنا',
          'Quick_Links'=>'روابط سريعة',
          'Contact_Info'=>'معلومات التواصل',
          'Follow_Us'=>'تابعنا',
          'Admin Panel'=>'لوحة تحكم الأدمن',
          'about_clinic'=>"مرحبًا بك في kari clinic في عيادتنا، نحن ملتزمون بتقديم خدمات الرعاية الصحية عالية الجودة التي تضع رفاهيتك في المقام الأول. فريقنا ذو الخبرة من العاملين في مجال الرعاية الصحية ملتزم بتقديم رعاية متفانية وضمان راحتك طوال زيارتك. سواء كنت تبحث عن نصائح طبية أو علاج أو حتى فحص طبي، فإننا هنا لخدمتك. صحتك وسعادتك هما هما قلقنا الأساسي. نتطلع إلى مساعدتك في الحفاظ على حياة صحية ومليئة بالسعادة.",
          'Coming_Soon'=>'قريباً',
          'Analysis'=>'التحاليل',
          'Rays'=>'الأشعة',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',


];