app/Listeners/SendNotificationToPatient.php

    public function handle(AppointmentApproved $event)
    {
        //
        $reservation = $event->reservation;
        $patient = Patient::findOrFail($reservation->id);
---
select * from `patients` where `patients`.`patient_id` = 10 and `patients`.`deleted_at` is null limit 1