<?php 

return [ 
          // classes
          'pull'=>'pull-left',


          'Rays'=>'الأشعة / التحليل',
          'Add_Rays'=>'إضافة الأشعة / التحليل',     
          'Edit_Rays'=>'تعديل الأشعة / التحليل',    
          'Reservation'=>'الكشف',
          'Patient_Name'=>'أسم المريض',
          'Rays_Name'=>'أسم الأشعة / التحليل',
          'Rays_Type'=>'نوع الأشعة / التحليل',
          'Rays_Date'=>'تاريخ الأشعة / التحليل',
          'Rays_Image'=>'صورة الأشعة / التحليل',
          'Add'=>'أضافة',
          'Edit'=>'تعديل',
          'All_Rays'=>'جميع الأشعة / التحليل',
          'Rays_Number'=>'أشعة / تحليل رقم',
          'Report'=>'التقارير',
          'Id'=>'Id',
          'Reservation_Id'=>' Id الكشف',
          'rays'=>'الأشعة / التحليل',
          'Control'=>'التحكم',
          ''=>'',
          ''=>'',
          ''=>'',

];

?>