<?php 

return [
          'Users'=>'المستخدمين',
          'All_Users'=>'كل المستخدمين',
          'Id'=>'Id',
          'User_Name'=>'أسم المستخدم', 
          'Email'=>'البريد الألكترونى',
          'User_Type'=>'نوع المستخدم',
          'Control'=>'التحكم',

          // add user
          'Add_User'=>'أضافة مستخدم',
          'Password'=>'الباسورد',
          'Roles'=>'صلاحيات المستخدم',
          'Choose'=>'أختار من القائمة',
          'Admin'=>'أدمن',
          'Doctor'=>'دكتور',
          'Add'=>'أضافة',
          'Edit'=>'تعديل',

          'Edit_User'=>'تعديل المريض',
          ''=>'',

];

?>