app/Http/Livewire/Calendar.php

select `id`, `title`, `start` from `events` where `events`.`deleted_at` is null
---
    public function render()
    {
        $events = Event::select('id','title','start')->get();