<?php 

return [ 
          'Events'=>'الأحداث',
          'All_Events'=>'كل الأحداث',
          'Id'=>'Id',
          'Event_Title'=>'عنوان الحدث',
          'Event_Date'=>'تاريخ الحدث',
          'Control'=>'التحكم',
          'Deleted_Events'=>'الأحداث المحذوفة',
          'Restore'=>'إعادة',
          'Delete_Forever'=>'حذف نهائى',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',
          ''=>'',

];

?>