app/Actions/Fortify/CreateNewPatient.php

    public function create(array $input)
    {
        Validator::make($input, [
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'email', 'max:255', 'unique:patients'],
            'password' => ['required', 'string'],
            'phone'=>['required','min:11','regex:/^([0-9\s\-\+\(\)]*)$/'],
            'age' => ['nullable','max:3','regex:/^([0-9\s\-\+\(\)]*)$/'],
            'blood_group' => ['nullable'],
            'address'=>['required'],
            'gender'=>['required']
        ], [
            'name.required'=>'برجاء أدخال الأسم بالكامل',
            'email.required'=>'برجاء أدخال البريد الألكترونى',
            'email.email'=>' برجاء أدخال البريد الألكترونى بشكل صحيح',
            'email.unique'=>'هذا البريد موجود من قبل',
            'password.required'=>'برجاء أدخال كلمة المرور',
            'address.required'=>'برجاء أدخال العنوان',
            'phone.required'=>'برجاء أدخال رقم الهاتف ',
            'gender.required'=>'برجاء أدخال نوع المريض ',
        ])->validate();

        // return
        $patient =    Patient::create([
            'name' => $input['name'],
            'email' => $input['email'],
            'password' => Hash::make($input['password']),
            'phone' => $input['phone'],
            'age' => $input['age'],
            'blood_group' => $input['blood_group'],
            'gender' => $input['gender'],
            'address' => $input['address'],
        ]);
---
insert into `patients` (`name`, `email`, `password`, `phone`, `age`, `blood_group`, `gender`, `address`, `patient_code`, `updated_at`, `created_at`) values ('أحمد', 'ahmed11@gmail.com', '$2y$10$q9CSkk9Y0o/C/jeicKBuru0/qeqKXVKmuGuyWhTzgd0pZPHSil/c2', '01111111111', '24', 'AB+', 'male', 'بنها', 20230007, '2023-07-20 11:59:36', '2023-07-20 11:59:36')