app/Actions/Fortify/CustomAuthentication.php

select * from `users` where `email` = 'Shabankareem919@gmail.com' and `users`.`deleted_at` is null limit 1
---
    public function authenticateClinicUser($request)
    {
        $email = $request->email;
        $password = $request->password;
        $user = User::where('email', '=', $email)
        ->where('organization_type', '=', Clinic::class)
        ->whereHas('organization',function($query){
            $query->where('status', 1);
        })
        ->first();