app/Http/Controllers/Frontend/AppointmentsController.php

    public function index()
    {
        $patient_id = Auth::user('patient')->patient_id;


        // get all reservations
        $reservations = Reservation::where('patient_id', '=', $patient_id)
        ->where('acceptance', '=', 'approved')->get();


        // get reservation controls
        $reservation_controls = ReservationControl::all();
---
select * from `reservations` where `patient_id` = 10 and `acceptance` = 'approved' and `reservations`.`deleted_at` is null
select * from `reservation_controls`

    public function add()
    {

        $slots = [];
        $reservation_slots = null;
        $today_reservation_res_num = null;
        $number_of_res = null;

        // get reservation settings
        $settings = ReservationControl::pluck('value','key');

        $user_id = Auth::user('patient')->patient_id;

        // get patient based on patient_id
        $patient = Patient::where('patient_id', '=', $user_id)->first();

        $current_date = Carbon::now('Egypt')->format('Y-m-d');



        /// get today reservations get there numbers from Reservation table
        $today_reservation_res_num = Reservation::where('res_date', $current_date)->value('res_num');

        /// get today reservations get there numbers from NumberOfReservations table
        $number_of_res = NumberOfReservations::where('reservation_date', $current_date)->value('num_of_reservations');

        $today_reservation_slots = Reservation::where('slot', $current_date)->value('slot');

        $reservation_slots = ReservationSlots::where('date', $current_date)->first();
---
select `value`, `key` from `reservation_controls`
select * from `patients` where `patient_id` = 10 and `patients`.`deleted_at` is null limit 1
select `res_num` from `reservations` where `res_date` = '2023-07-20' and `reservations`.`deleted_at` is null limit 1
select `num_of_reservations` from `number_of_reservations` where `reservation_date` = '2023-07-20' limit 1
select `slot` from `reservations` where `slot` = '2023-07-20' and `reservations`.`deleted_at` is null limit 1
select * from `reservation_slots` where `date` = '2023-07-20' limit 1

    public function getResNumberOrSlot(Request $request)
    {

        $res_date =  $request->res_date;

        // if system use reservation numbers not slots
        $reservation_res_num = Reservation::where('res_date', $res_date)->pluck('res_num')->map(function ($item) {
            return intval($item);
        })->toArray();
        $number_of_res = NumberOfReservations::where('reservation_date', $res_date)->value('num_of_reservations');


        // if system use reservation slots not numbers
        $reservation_slots = Reservation::where('res_date', $res_date)
        ->where('slot', '<>', 'null')->pluck('slot')->toArray();
        $number_of_slot = ReservationSlots::where('date', $res_date)->first();
---
select `res_num` from `reservations` where `res_date` = '2023-07-20' and `reservations`.`deleted_at` is null
select `num_of_reservations` from `number_of_reservations` where `reservation_date` = '2023-07-20' limit 1
select `slot` from `reservations` where `res_date` = '2023-07-20' and `slot` <> 'null' and `reservations`.`deleted_at` is null
select * from `reservation_slots` where `date` = '2023-07-20' limit 1