app/Http/Controllers/Frontend/HomeController.php

    public function index()
    {

        $patients = Patient::count();
        $reservations = Reservation::count();
---
select count(*) as aggregate from `patients` where `patients`.`deleted_at` is null
select count(*) as aggregate from `reservations` where `reservations`.`deleted_at` is null

    public function dashboard()
    {
        // get all reservations
        $all_reservations_count = Reservation::where('patient_id', Auth::user('patient')->patient_id)->count();

        $approved_reservations_count = Reservation::where('patient_id', Auth::user('patient')->patient_id)
        ->where('acceptance', 'approved')
        ->count();
---
select count(*) as aggregate from `reservations` where `patient_id` = 10 and `reservations`.`deleted_at` is null
select count(*) as aggregate from `reservations` where `patient_id` = 10 and `acceptance` = 'not_approved' and `reservations`.`deleted_at` is null