app/Models/Patient.php

    public static function getNextPatientCodeNumber()
    {
        // SELECT MAX(number) FROM patients
        $year = Carbon::now()->year;
        $number = Patient::whereYear('created_at', $year)->max('patient_code');
---
select max(`patient_code`) as aggregate from `patients` where year(`created_at`) = 2023 and `patients`.`deleted_at` is null