app/Providers/AppServiceProvider.php

select * from `system_controls`
---
    public function boot()
    {
        //
        // remove "data" wrapper from json resource response
        JsonResource::withoutWrapping();

        view()->composer('backend.layouts.main-sidebar', function ($view) {
            $collection = SystemControl::all();
            $setting = $collection->flatMap(function ($collection) {
                return [$collection->key => $collection->value];
            });