app/Http/Controllers/Backend/DashboardController.php

select count(*) as aggregate from `patients` where `patients`.`deleted_at` is null
select * from `patients` where `patients`.`deleted_at` is null
select count(*) as aggregate from `users` where `users`.`deleted_at` is null
select count(*) as aggregate from `reservations` where `reservations`.`deleted_at` is null
select `res_date` from `reservations` where `res_date` between '2023-07-13 13:00:49' and '2023-07-20 13:00:49' and `reservations`.`deleted_at` is null
select count(*) as aggregate from `online_reservations`
select count(*) as aggregate from `reservations` where `res_date` = '2023-07-20' and `reservations`.`deleted_at` is null
select sum(`cost`) as aggregate from `reservations` where `res_date` = '2023-07-20' and `reservations`.`deleted_at` is null
select sum(`cost`) as aggregate from `reservations` where `month` = '07' and `payment` = 'paid' and `reservations`.`deleted_at` is null
select * from `reservations` where `reservations`.`deleted_at` is null order by `created_at` desc limit 5
select `patient_id`, `name` from `patients` where `patients`.`patient_id` in (1, 2, 3, 4) and `patients`.`deleted_at` is null
select * from `online_reservations` order by `created_at` desc limit 5
---
    public function index()
    {
        // get current date on egypt
        $current_date = Carbon::now('Egypt')->format('Y-m-d');

        // get count of all patients
        $patients_count = Patient::count();

        $patients = Patient::all();

        $user_count = User::count();

        // get all reservations
        $all_reservations_count = Reservation::count();

        $startDate = Carbon::now()->subDays(7);
        $endDate = Carbon::now();

        $reservations_res_date = Reservation::whereBetween('res_date', [$startDate, $endDate])->pluck('res_date');
        // dd($startDate,$reservations_res_date);

        // get all reservations
        $online_reservations_count = OnlineReservation::count();

        // get reservation where res_date = current_date
        $today_res_count = Reservation::where('res_date', $current_date)->count();

        // $medicines_count = Medicine::count();
        $medicines_count = 7759;

        $today_payment = Reservation::where('res_date', $current_date)->sum('cost');

        $current_month = Carbon::now('Egypt')->format('m');

        $month_payment = Reservation::where('month', $current_month)->where('payment', 'paid')->sum('cost');

        $last_patients= Patient::select('patient_id', 'name', 'phone')->withCount('reservations')->latest()->take(5)->get();

        $reservations = Reservation::with('patient:patient_id,name')->latest()->take(5)->get();

        $online_reservations = OnlineReservation::latest()->take(5)->get();

select * from `reservation_slots` where `date` = '2023-07-20' limit 1
---
            $date = now()->subDays($i);
            $dateFormatted = $date->format('Y-m-d');
            $activeClass = $i == 0 ? 'active show' : '';
            $number_of_slot = ReservationSlots::where('date', '=', $dateFormatted)->first();