app/Http/Controllers/Backend/EventController.php

select * from `events` where `events`.`deleted_at` is null
---
    public function index()
    {

        // get current date on egypt
        $current_date = Carbon::now('Egypt')->format('Y-m-d');
        // get all events
        $events = Event::all();