app/Http/Controllers/Backend/PatientController.php

select * from `patients` where `patients`.`deleted_at` is null
select * from `reservations` where `reservations`.`patient_id` in (1) and `reservations`.`deleted_at` is null
---
    public function index()
    {
        $this->authorizeCheck('عرض المرضى');

        $patients = $this->patient->with('reservations')->get();