app/Http/Controllers/Backend/UserController.php

select * from `users` where `users`.`deleted_at` is null
---
    public function index(){

        // get all users
        $users = User::all();